Revit 2027 API
MEPAnalyticalModelData.GetMEPAnalyticalModelData Method
 Gets the MEP analytical model data of the specified element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MEPAnalyticalModelData GetMEPAnalyticalModelData(
	Element pElement
)
Public Shared Function GetMEPAnalyticalModelData (
	pElement As Element
) As MEPAnalyticalModelData
public:
static MEPAnalyticalModelData^ GetMEPAnalyticalModelData(
	Element^ pElement
)
static member GetMEPAnalyticalModelData :
        pElement : Element -> MEPAnalyticalModelData
Parameters
pElement Element
 The element that owns the MEP analytical model data.
Return Value
MEPAnalyticalModelData
 The MEP analytical model data of this element, null if not available.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace